Repository: Xoristzatziki/GladerRAD
Catalog: locale/*/LC_MESSAGES/GladerRAD.po
Languages: el

source: Glade file:
el: Αρχείο Glade:

source: Select a Glade file
el: Επιλέξτε αρχείο Glade

source: Select a Glade File
el: Επιλέξτε αρχείο Glade

source: Theme:
el: Θέμα:

source: Change theme used for showing the generated code.
el: Αλλάξτε το θέμα που θα χρησιμοποηθεί για την εμφάνιση του κώδικα που παραχθεί.

source: Shows the path to selected input Glade file.
el: Δείχνει τη διαδρομή που βρίσκεται το αρχείο Glade.

source: No file selected
el: Δεν έχει επιλεγεί αρχείο

source: App name:
el: Όνομα της εφαρμογής:

source: The name that application is going to use.
el: Το όνομα που θα χρησιμοποιήσει η εφαρμογή.

source: Class name:
el: Όνομα της κλάσης.

source: Name of section that will hold settings for this window only. Also the name of the class for the window. Other windows may use the same configuration file if they have different"section" name.
el: Το όνομα που θα χρησιμοποιήσει η εφαρμογή για τη δημιουργία section στο αρχείο ρυθμίσεων. Το όνομα αυτό θα χρησιμοποιηθεί και σαν όνομα της κλάσης.

source: Intgrade Glade
el: Ενσωμάτωση Glade

source: Check it if you want the glade file to be included as text in the generated code, in order not to distribute as a separate file.
el: Τσεκάρετε αν θέλετε το αρχείο Glade να ενσωματωθεί στο αρχείο της python σαν κείμενο ώστε να μην χρειάζετε να το διανείμετε ξεχωριστά.

source: Generated code:
el: Παραχθείς κώδικας:

source: Change font (font family or size) for showing the generated code.
el: Αλλάζει τη γραμματοσειρά (οικογένεια και μέγεθος) στο παράθυρο που εμφανίζει τον παραχθέντα κώδικα.

source: Shows the generated code. Click "Save as" to save it.
el: Δείχνει τον κώδικα που παρήγαγε το πρόγραμμα. Πατήστε "Αποθήκευση ως..." για να τον αποθηκεύσετε.

source: Regenerate the code if you changed the Glade file.
el: Ξαναφτιάχνει τον κώδικα αν αλλάξατε κάτι στο αρχείο Glade.

source: Regenerate
el: Επαναφόρτωση.

source: Make executable
el: Εκτελέσιμο

source: Check if you want to make the saved file executable (for non MS OSes)
el: Τσεκάρετε αν θέλετε να κάνετε το αρχείο εκτελέσιμο μετά την αποθήκευση (για λειτουργικά που απαιτείται)

source: Save the code.
el: Αποθήκευση του κώδικα

source: Exit
el: Έξοδος

source: Warnings:
el: Προειδοποιήσεις:

source: Generated app name, maybe not a good choise!
el: Αυτόματο όνομα για την εφαρμογή, μάλλον κακή ιδέα!

source: Generated class name, maybe not a good choise!
el: Αυτόματο όνομα για την κλάση, μάλλον κακή ιδέα!

source: There is nothing to save.
el: Δεν υπάρχει τίποτε για αποθήκευση.

source: File: {respfile} already exists. Overwrite?
el: Το αρχείο: {respfile} υπάρχει ήδη. Να αντικατασταθεί;

source: There was an error writing to
el: Παρουσιάστηκε σφάλμα κατά την εγγραφή σε

source: File was saved
el: Το αρχείο αποθηκεύτηκε

source: Mode +rwx (774) was set to make it executable.
el: Το +rwx (774) χρησιμοποιήθηκε για να κάνει το αρχείο εκτελέσιμο.

source: Unable to make it executable
el: Αδυναμία αλλαγής σε εκτελέσιμο

source: _Yes
el: _Ναι

source: _OK
el: _Εντάξει

source: _No
el: _Όχι

source: _Cancel
el: _Ακύρωση

source: OK
el: Εντάξει
